//-----------------------------------------------------------------
//	名称: 键盘扫描程序
//-----------------------------------------------------------------
#include <reg51.h>
#include <intrins.h>
char code keycodes[] = 					//矩阵键盘键值表
{	'7','8','9','/',
	'4','5','6','*',
	'1','2','3','-',
	'C','0','=','+'
};
//上述数组也可以定义为:
//char code keycodes = "789/456*123-C0=+";
char xdata keyflags[4][4];			//16键键位状态标识数组(1:按下 0:未按下)
//-----------------------------------------------------------------
// 获取键盘按键字符子程序
//-----------------------------------------------------------------
char GetKeyChar()
{
	char r,c,ColData = 0;
	for(r=0;r<4;r++)//循环扫描4行
	{
		P2 = (0xEF<<r); _nop_();//P2输出行扫描码(初值0xEF:1110 1111)
		ColData = P1 & 0x0F;//从P1端口读取列码数据()
		for(c=0;c<4;c++){//循环检查当前列的4行
			//如果当前的i行j列有键按下
			if( (ColData & (1<<c) ) == 0x00 ){
				//且该位此前标识为0(即无键按下，或按下后释放了)
				if(keyflags[r][c]==0){
					keyflags[r][c] = 1;
					P2 = 0xFF;//结束扫描，在P2端口放置全1
					return keycodes[r*4+c];//最后返回键值ASCII码
				}
				else{
					return 0;//否则表示虽然检测到改键按下，但此前状态亦为按下，故不返回键值而返回0
				}
			}
			else{
				keyflags[r][c] = 0;//在当前位置无键按下，keyflags对应位置置0
			}
		}
	}
	P2 = 0xFF;//扫描结束，当前无键按下
	return 0;
}