//-----------------------------------------------------------------
// 名称: 单行液晶显示程序(接口扩展方式驱动显示)
//-----------------------------------------------------------------
#include <reg51.h>
#include <absacc.h>
#define INT8U unsigned char
#define LCD_CMD_WR		0x00	//接口扩展地址为0x8000
#define LCD_DATA_WR		0x01	//接口扩展地址为0x8001
#define LCD_BUSY_RD		0x02	//接口扩展地址为0x8002
#define LCD_DATA_RD		0x03	//接口扩展地址为0x8003
#define LCD_CLS			1		//清屏命令
#define LCD_HOME		2		//光标归位
#define LCD_SETMODE		4		//模式设置
#define LCD_SETVISIBLE	8		//开显示
#define LCD_SHIFT		16		//移位方式
#define LCD_SETFUNCTION	32		//功能设置
#define LCD_SETCGADDR	64		//设置CGRAM地址
#define LCD_SETDDADDR	128		//设置DDRAM地址
sbit bflag = ACC^7; 			//忙标志位
//-----------------------------------------------------------------
// 忙等待
//-----------------------------------------------------------------
void busywait()				{ do{ ACC = XBYTE[0x8002];}  while (bflag == 1); }
//-----------------------------------------------------------------
// 向LCD写命令字节
//-----------------------------------------------------------------
void Write_CMD(INT8U cmd)	{ XBYTE[0x8000] = cmd; busywait();}
//-----------------------------------------------------------------
// 向LCD写数据字节
//-----------------------------------------------------------------
void Write_Dat(char dat)	{ XBYTE[0x8001] = dat; busywait(); }
//-----------------------------------------------------------------
// 清屏并将显示位置起点设置在最右边
//-----------------------------------------------------------------
void Clearscreen()			{ Write_CMD(LCD_CLS); Write_CMD(LCD_SETDDADDR + 15);}
//-----------------------------------------------------------------
// 初始化LCD
//-----------------------------------------------------------------
void Initialise_LCD()
{
	Write_CMD(0x30);//1行8位
	Write_CMD(LCD_SETVISIBLE + 4);//显示开，关光标
	Write_CMD(LCD_SETDDADDR + 15);//从右边开始显示
	Write_CMD(LCD_SETMODE + 3);//递增左移

}
//-----------------------------------------------------------------
// LCD显示字符串
//-----------------------------------------------------------------
void LCD_Disp_String(char buf[])
{ 
	INT8U i = 0;
	Clearscreen();//清屏
	while(buf[i]){
		Write_Dat(buf[i++]);//输出显示缓冲中的所有字符
	}
}
